Zektopic/ESP32-CAM_MJPEG2SD/webServer.cpp
// Provides web server for user control of app
//
// s60sc 2022 - 2023

#include "appGlobals.h"
#include "stringUtils.h"

#define MAX_HANDLERS 12

char inFileName[IN_FILE_NAME_LEN];
static char variable[FILE_NAME_LEN];
static char value[IN_FILE_NAME_LEN];
static char retainAction[2];
int refreshVal = 5000; // msecs

static httpd_handle_t httpServer = NULL; // web server port
static int fdWs = -1; // websocket sockfd
static httpd_handle_t sseSocketHD; // SSE support
static int sseSocketFD;
bool useHttps = false;
bool useSecure = false;
bool heartBeatDone = false;

static byte* chunk;

esp_err_t sendChunks(File df, httpd_req_t *req, bool endChunking) {
  // use chunked encoding to send large content to browser
  size_t chunksize = 0;
  esp_err_t res = ESP_OK;
  while ((chunksize = df.read(chunk, CHUNKSIZE))) {
    res = httpd_resp_send_chunk(req, (char*)chunk, chunksize);
    if (res != ESP_OK) break;
    // httpd_sess_update_lru_counter(req->handle, httpd_req_to_sockfd(req));
  }
  if (endChunking) {
    df.close();
    httpd_resp_sendstr_chunk(req, NULL);
  }
  if (res != ESP_OK) LOG_WRN("Failed to send to browser: %s, err %s", inFileName, espErrMsg(res));
  return res;
}

esp_err_t fileHandler(httpd_req_t* req, bool download) {
  // send file contents to browser
  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
  if (!strcmp(inFileName, LOG_FILE_PATH)) flush_log(false);
  File df = STORAGE.open(inFileName);
  if (!df) {
    LOG_WRN("File does not exist or cannot be opened: %s", inFileName);
    httpd_resp_send_404(req);
    return ESP_FAIL;
  }
  if (!df.size()) {
    // file is empty
    df.close();
    httpd_resp_sendstr(req, NULL);
    return ESP_OK;
  }

  // Check if browser already has this version of the file
  char inVer[10];
  if (httpd_req_get_hdr_value_str(req, "If-None-Match", inVer, sizeof(inVer)) == ESP_OK) {
    if (atoi(inVer) == CFG_VER) {
      // already has version cached, no need to resend
      httpd_resp_set_status(req, "304 Not Modified");
      return httpd_resp_send(req, NULL, 0);
    }
  }
  // this version not cached, so send it
  httpd_resp_set_hdr(req, "Cache-Control", "no-cache");
  itoa(CFG_VER, inVer, 10);
  httpd_resp_set_hdr(req, "ETag", inVer);
  return (download) ? downloadFile(df, req) : sendChunks(df, req);
}

static void displayLog(httpd_req_t *req) {
  // output ram log to browser
  if (logType == 0) {
    int startPtr, endPtr;
    startPtr = endPtr = mlogEnd;
    httpd_resp_set_type(req, "text/plain");

    // output log in chunks
    do {
      int maxChunk = startPtr < endPtr ? endPtr - startPtr : RAM_LOG_LEN - startPtr;
      size_t chunkSize = std::min(CHUNKSIZE, maxChunk);
      if (chunkSize > 0) httpd_resp_send_chunk(req, messageLog + startPtr, chunkSize);
      startPtr += chunkSize;
      if (startPtr >= RAM_LOG_LEN) startPtr = 0;
    } while (startPtr != endPtr);
    httpd_resp_sendstr_chunk(req, NULL);
  }
}

bool checkAuth(httpd_req_t* req) {
  // check if authentication is required
  if (strlen(Auth_Name)) {
    // authentication required
    size_t credLen = strlen(Auth_Name) + strlen(Auth_Pass) + 2; // +2 for colon & terminator
    char credentials[credLen];
    snprintf(credentials, credLen, "%s:%s", Auth_Name, Auth_Pass);
    const char* encodedCreds = encode64(credentials);
    size_t expectedLen = strlen("Basic ") + strlen(encodedCreds) + 1;
    char expectedAuth[expectedLen];
    snprintf(expectedAuth, expectedLen, "Basic %s", encodedCreds);

    size_t authHdrLen = httpd_req_get_hdr_value_len(req, "Authorization");
    bool authenticated = false;

    if (authHdrLen) {
      // check credentials supplied are valid
      size_t authLen = authHdrLen + 1;
      char auth[authLen];
      if (httpd_req_get_hdr_value_str(req, "Authorization", auth, authLen) == ESP_OK) {
        if (strcmp(auth, expectedAuth) == 0) authenticated = true;
      }
    }
    if (!authenticated) {
      // not authenticated
      httpd_resp_set_hdr(req, "WWW-Authenticate", "Basic");
      httpd_resp_set_status(req, "401 Unauthorised");
      httpd_resp_sendstr(req, NULL);
      return false;
    }
  }
  return true; // authentication ok or not required
}

static esp_err_t indexHandler(httpd_req_t* req) {
  strcpy(inFileName, INDEX_PAGE_PATH);
  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
  // first check if a startup failure needs to be reported
  if (strlen(startupFailure)) {
    httpd_resp_set_type(req, "text/html");
    httpd_resp_sendstr_chunk(req, failPageS_html);
    httpd_resp_sendstr_chunk(req, startupFailure);
    httpd_resp_sendstr_chunk(req, failPageE_html);
    httpd_resp_sendstr_chunk(req, NULL);
    return ESP_OK;
  }
  // Show wifi wizard if not setup, using access point mode
  if (!STORAGE.exists(INDEX_PAGE_PATH) && WiFi.status() != WL_CONNECTED) {
    // Open a basic wifi setup page
    httpd_resp_set_type(req, "text/html");
    return httpd_resp_sendstr(req, setupPage_html);
  } else if (!checkAuth(req)) return ESP_OK; // check if authentication required & passed

  return fileHandler(req);
}

esp_err_t extractHeaderVal(httpd_req_t *req, const char* variable, char* value, size_t valueSize) {
  // check if header field present, if so extract value
  esp_err_t res = ESP_FAIL;
  size_t hdrFieldLen = httpd_req_get_hdr_value_len(req, variable);
  if (!hdrFieldLen) return ESP_ERR_INVALID_ARG; // header not present
  else if (hdrFieldLen >= valueSize - 1) LOG_WRN("Field %s value too long (%d)", variable, hdrFieldLen);
  else {
    res = httpd_req_get_hdr_value_str(req, variable, value, hdrFieldLen + 1);
    if (res != ESP_OK) LOG_ERR("Value for %s could not be retrieved: %s", variable, espErrMsg(res));
  }
  return res;
}

esp_err_t extractQueryKeyVal(httpd_req_t *req, char* variable, char* value, size_t valueSize) {
  // get variable and value pair from URL query
  size_t queryLen = httpd_req_get_url_query_len(req) + 1;
  if (queryLen > FILE_NAME_LEN) {
    LOG_ERR("Query string too long");
    httpd_resp_set_status(req, "400 Invalid query string");
    httpd_resp_sendstr(req, NULL);
    return ESP_FAIL;
  }
  httpd_req_get_url_query_str(req, variable, queryLen);
  // extract key
  char* endPtr = strchr(variable, '=');
  if (endPtr != NULL) {
    *endPtr = 0; // split variable into 2 strings, first is key name
    strncpy(value, endPtr + 1, valueSize - 1); // value is now second part of string, avoiding redundant strlen
    value[valueSize - 1] = 0; // ensure null termination
    urlDecode(variable);
    urlDecode(value);
    if (isPathTraversal(variable) || isPathTraversal(value)) {
      LOG_WRN("Path traversal attempt detected in query string");
      httpd_resp_set_status(req, "400 Bad Request");
      httpd_resp_sendstr(req, "Path traversal not allowed");
      return ESP_FAIL;
    }
  } else {
    urlDecode(variable);
    LOG_ERR("Invalid query string %s", variable);
    httpd_resp_set_status(req, "400 Invalid query string");
    httpd_resp_sendstr(req, NULL);
    return ESP_FAIL;
  }
  return ESP_OK;
}

